<?php

namespace Database\Seeders;

use App\Models\Sport;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class SportSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
      DB::table('sports')->insert([
         [
             'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
             'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
             'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
             'created_at'=>now(),
               'updated_at'=>now(),
         ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
              'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
              'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],


          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
              'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
              'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
              'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
              'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
              'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
              'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Зухриддин Кадыров стал первым в истории Узбекистана чемпионом мира по фехтованию',
              'description'=>'Во втором дне юниорского и молодёжного чемпионата мира по фехтованию в ОАЭ саблист Зухриддин
             Кадыров стал первым в истории Узбекистана фехтовальщиком, завоевавшим титул чемпиона мира. Об этом сообщает пресс-служба НОК.
                            Согласно данным, узбекистанец победил представителей Канады, Египта, Венгрии, США, а в финале превзошёл атлета
                            из Германии. В решающей встрече Кадыров одолел Колина Хеткока со счётом 15:13.
                         Кроме того, до четвертьфинала дошли Самира Шокирова и Мусо Айтмуродов, но они остались в шаге от пьедестала.',
              'photo'=>'https://repost.uz/storage/uploads/0-1649044705-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/2862-1648901958-jasur2000-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
          [
              'name'=>'Оксана Чусовитина отметилась золотой медалью на Кубке мира в Баку',
              'description'=>'Оксана Чусовитина выиграла золотую медаль на Кубке мире по спортивной гимнастике в Баку.

                 Гимнастка из Узбекистана одержала победу в опорном прыжке с результатом 13,266 баллов.

               Благодаря результатам, достигнутым в рамках серии этапов Кубка мира, Оксана Чусовитина стала обладательницей Кубка FIG..',
              'photo'=>'https://repost.uz/storage/uploads/0-1637854491-avto-post-material.jpeg',
              'created_at'=>now(),
              'updated_at'=>now(),
          ],
      ]);
    }
}
